04_OpenFoam/_ref/OpenFOAMTeaching/JozsefNagy/livestreams/01_First-tutorial/S1/elbow_quad/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

samples
{
    type                    sets;
    libs                    (sampling);
    setFormat               raw;
    interpolationScheme     cell;
    fields                  (U p);
    writeControl            writeTime;

    sets
    (
        myLine
        {
            type        uniform;
            axis        distance;
			nPoints		1000;
            start       (22 -37 0);
            end         (25 33 0);
        }
    );
}


// *********************************************************************** //
